# =============================================================================
# МОДУЛЬ 2. СТАТИСТИЧЕСКИЕ ГРАФИКИ — SEABORN
# =============================================================================
# Дисциплина: Проектно-технологическая практика
# Задание 2. Визуализация финансовых данных
#
# Автор:   [ФИО студента]
# Группа:  [номер группы]
# Дата:    [дата выполнения]
# Данные:  [название предприятия / демонстрационные данные]
#
# Что делает этот файл:
#   График 1 — тепловая карта (heatmap):  все коэффициенты за 3 года
#   График 2 — столбцы (barplot):         коэффициенты ликвидности vs норматив
#   График 3 — линии (lineplot):          динамика рентабельности за 3 года
#
# Все графики сохраняются в папку charts/
# =============================================================================

import os
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import matplotlib.patches as mpatches
import seaborn as sns

# Поддержка кириллицы
matplotlib.rcParams["font.sans-serif"] = ["Arial", "Liberation Sans", "DejaVu Sans"]
matplotlib.rcParams["axes.unicode_minus"] = False

os.makedirs("charts", exist_ok=True)


# =============================================================================
# БЛОК ДАННЫХ
# =============================================================================

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ИЗМЕНИТЕ ЗДЕСЬ: укажите путь к вашему файлу данных                    │
# └─────────────────────────────────────────────────────────────────────────┘
DATA_FILE = "data.xlsx"

df_ratios = pd.read_excel(DATA_FILE, sheet_name="ratios")

print("Данные коэффициентов загружены:")
print(df_ratios)


# =============================================================================
# ГРАФИК 1. Тепловая карта финансовых коэффициентов — heatmap
# =============================================================================
# Зачем этот график: позволяет одним взглядом охватить все показатели за
# три года. Тёмный/светлый цвет клетки сигнализирует о высоком/низком
# значении. Удобен для обнаружения трендов и аномалий.

# Формируем матрицу: строки — годы, столбцы — коэффициенты
heatmap_data = df_ratios.set_index("year")

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ИЗМЕНИТЕ ЗДЕСЬ: русскоязычные названия столбцов для отображения       │
# └─────────────────────────────────────────────────────────────────────────┘
col_labels = {
    "current_ratio": "Текущая\nликвидность",
    "quick_ratio":   "Быстрая\nликвидность",
    "autonomy":      "Коэф.\nавтономии",
    "roa":           "ROA",
    "roe":           "ROE",
    "ros":           "ROS",
}
heatmap_data = heatmap_data.rename(columns=col_labels)

fig1, ax1 = plt.subplots(figsize=(11, 4))

sns.heatmap(
    heatmap_data,
    annot=True,          # показывать значения в ячейках
    fmt=".2f",           # формат: два знака после запятой
    cmap="YlGnBu",       # цветовая палитра (жёлто-зелёно-синяя)
    linewidths=0.5,
    linecolor="white",
    ax=ax1,
    annot_kws={"size": 11, "weight": "bold"},
)

ax1.set_yticklabels(
    [str(y) for y in df_ratios["year"].tolist()],
    rotation=0, fontsize=11,
)
ax1.set_xticklabels(ax1.get_xticklabels(), rotation=0, fontsize=10)

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ИЗМЕНИТЕ ЗДЕСЬ: заголовок — укажите название предприятия              │
# └─────────────────────────────────────────────────────────────────────────┘
ax1.set_title("Финансовые коэффициенты предприятия, 2022–2024",
              fontsize=13, fontweight="bold", pad=12)
ax1.set_ylabel("Год", fontsize=11)
ax1.set_xlabel("")

plt.tight_layout()
plt.savefig("charts/m2_ratios_heatmap.png", dpi=150, bbox_inches="tight")
plt.show()
print("График 1 сохранён: charts/m2_ratios_heatmap.png")

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ВАШ ВЫВОД ПО ГРАФИКУ 1:                                               │
# └─────────────────────────────────────────────────────────────────────────┘
# ВЫВОД: ...


# =============================================================================
# ГРАФИК 2. Коэффициенты ликвидности vs норматив — barplot
# =============================================================================
# Зачем этот график: сравнивает фактические значения показателей ликвидности
# с нормативными. Красная пунктирная линия обозначает минимально допустимый
# уровень. Столбец ниже линии — сигнал о проблеме.

# Берём данные последнего года
last_year = df_ratios[df_ratios["year"] == df_ratios["year"].max()].iloc[0]

liquidity_data = pd.DataFrame({
    "Коэффициент": [
        "Текущая\nликвидность",
        "Быстрая\nликвидность",
        "Абсолютная\nликвидность",
    ],
    "Факт": [
        last_year["current_ratio"],
        last_year["quick_ratio"],
        # Абсолютная ликвидность в данных не хранится — укажите вручную:
        # ┌───────────────────────────────────────────────────────────┐
        # │  ИЗМЕНИТЕ ЗДЕСЬ: фактическое значение абсолютной         │
        # │  ликвидности из отчёта audit-it.ru                       │
        # └───────────────────────────────────────────────────────────┘
        0.18,
    ],
})

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ИЗМЕНИТЕ ЗДЕСЬ: нормативные значения (стандартные значения уже        │
# │  проставлены; уточните по методическому источнику, если нужно)         │
# └─────────────────────────────────────────────────────────────────────────┘
norms = {
    "Текущая\nликвидность":    2.0,
    "Быстрая\nликвидность":    1.0,
    "Абсолютная\nликвидность": 0.2,
}

# Цвет столбца: зелёный — выше норматива, красный — ниже
colors = [
    "#A8D08D" if row["Факт"] >= norms[row["Коэффициент"]] else "#FF7C7C"
    for _, row in liquidity_data.iterrows()
]

fig2, ax2 = plt.subplots(figsize=(9, 5))

bars = ax2.bar(
    liquidity_data["Коэффициент"],
    liquidity_data["Факт"],
    color=colors,
    width=0.45,
    zorder=3,
)

# Подписи значений над столбцами
for bar in bars:
    h = bar.get_height()
    ax2.text(bar.get_x() + bar.get_width() / 2, h + 0.03,
             f"{h:.2f}", ha="center", va="bottom", fontsize=11, fontweight="bold")

# Линии нормативов
for i, (label, norm_val) in enumerate(norms.items()):
    ax2.hlines(norm_val, i - 0.3, i + 0.3,
               colors="#CC2222", linewidths=2, linestyles="--", zorder=4)
    ax2.text(i + 0.32, norm_val, f"норма {norm_val}",
             va="center", fontsize=9, color="#CC2222")

ax2.grid(axis="y", linestyle="--", alpha=0.4, zorder=0)

# Легенда
patch_ok  = mpatches.Patch(color="#A8D08D", label="Выше норматива")
patch_bad = mpatches.Patch(color="#FF7C7C", label="Ниже норматива")
ax2.legend(handles=[patch_ok, patch_bad], fontsize=10, loc="upper right")

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ИЗМЕНИТЕ ЗДЕСЬ: заголовок — укажите год                               │
# └─────────────────────────────────────────────────────────────────────────┘
ax2.set_title("Коэффициенты ликвидности: факт vs норматив (2024)",
              fontsize=13, fontweight="bold", pad=12)
ax2.set_ylabel("Значение коэффициента", fontsize=11)
ax2.set_ylim(0, max(liquidity_data["Факт"].max(), 2.2) * 1.2)

plt.tight_layout()
plt.savefig("charts/m2_ratios_vs_norm.png", dpi=150, bbox_inches="tight")
plt.show()
print("График 2 сохранён: charts/m2_ratios_vs_norm.png")

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ВАШ ВЫВОД ПО ГРАФИКУ 2:                                               │
# └─────────────────────────────────────────────────────────────────────────┘
# ВЫВОД: ...


# =============================================================================
# ГРАФИК 3. Динамика рентабельности — lineplot
# =============================================================================
# Зачем этот график: отображает, как менялась отдача от активов, капитала
# и продаж за три года. Три кривые на одном поле позволяют сравнить
# темпы роста разных показателей рентабельности.

# Переводим в проценты для наглядности
df_prof = df_ratios[["year", "roa", "roe", "ros"]].copy()
df_prof["roa"] = (df_prof["roa"] * 100).round(1)
df_prof["roe"] = (df_prof["roe"] * 100).round(1)
df_prof["ros"] = (df_prof["ros"] * 100).round(1)

# Приводим к «длинному» формату для seaborn
df_long = df_prof.melt(id_vars="year", var_name="indicator", value_name="value")

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ИЗМЕНИТЕ ЗДЕСЬ: русскоязычные названия показателей в легенде          │
# └─────────────────────────────────────────────────────────────────────────┘
label_map = {"roa": "ROA — рент. активов", "roe": "ROE — рент. капитала",
             "ros": "ROS — рент. продаж"}
df_long["indicator"] = df_long["indicator"].map(label_map)

palette = {"ROA — рент. активов": "#2E5090",
           "ROE — рент. капитала": "#E8844A",
           "ROS — рент. продаж": "#A8D08D"}

fig3, ax3 = plt.subplots(figsize=(10, 5))

sns.lineplot(
    data=df_long, x="year", y="value",
    hue="indicator", palette=palette,
    marker="o", markersize=9, linewidth=2.5,
    ax=ax3,
)

# Подписи значений на каждой точке
for _, row in df_long.iterrows():
    ax3.annotate(
        f"{row['value']}%",
        xy=(row["year"], row["value"]),
        xytext=(0, 10), textcoords="offset points",
        ha="center", fontsize=9,
    )

ax3.set_xticks(df_ratios["year"].tolist())
ax3.set_xticklabels([str(y) for y in df_ratios["year"].tolist()], fontsize=11)
ax3.grid(axis="y", linestyle="--", alpha=0.4)
ax3.set_ylabel("Рентабельность, %", fontsize=11)
ax3.set_xlabel("Год", fontsize=11)
ax3.legend(title="", fontsize=10, loc="upper left")

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ИЗМЕНИТЕ ЗДЕСЬ: заголовок                                             │
# └─────────────────────────────────────────────────────────────────────────┘
ax3.set_title("Динамика показателей рентабельности, 2022–2024",
              fontsize=13, fontweight="bold", pad=12)

plt.tight_layout()
plt.savefig("charts/m2_profit_dynamics.png", dpi=150, bbox_inches="tight")
plt.show()
print("График 3 сохранён: charts/m2_profit_dynamics.png")

# ┌─────────────────────────────────────────────────────────────────────────┐
# │  ВАШ ВЫВОД ПО ГРАФИКУ 3:                                               │
# └─────────────────────────────────────────────────────────────────────────┘
# ВЫВОД: ...

print("\nМодуль 2 выполнен. Все графики сохранены в папку charts/")
